from random import randint
print("Гра Блек Джек")
black=0
p=0
dg=0
white=0
print("Перший гравець починає")
while black==0:
    if p>21:
        print("Ваше сумарне число більше 21 тому ви програли, пощастить наступного разу")
        break
    elif p == 21:
        print("Ви вийграли другого гравця , більше карт не треба")
        break
    else:
        chislo=randint(2,11)
        a=input("Будете вибирати  ?Дайте відповідь Так або Ні \n")
        t="Так"
        n="Ні"
        if a==t:
            p=p+chislo
            print("Ваше сумарне число",p)
            print("Вибирайте далі")
        elif a==n:
            print("Ви вирішили закінчити гру Ваше сумарне число",p)
            print("Хід другого гравця")
            break
        else:
            print("Ви ввели не так спрбуйте ще раз")
            input("Нажміть Enter, щоб продовжити")
print("Черга другого гравця,Оберіть карту")
while white==0:
        if dg > 21:
            print("Ваше сумарне число більше 21 тому ви програли")
            white=1
        else:
            chislo2=randint(2,11)
            y=input("Чи будете вибирати ви ?Дайте відповідь Так або Ні \n")
            t2="Так"
            n2="Ні"
            if y==t2:
                dg=dg+chislo2
                print("Ваше сумарне число",dg)
                print("Вибирайте далі")
            if y==n2:
                print("Ви вирішили закінчити гру\nВаше сумарне число",dg)
                white=1
            elif y != n2 or y != t2:
                print("Ви ввели не так спрбуйте ще раз")
                input("Нажміть Enter, щоб продовжити")
            elif dg == 21:
                print("Гравець під номером 2 вийграв бо його сумма чисел =21 ")
                break
